
<?php
/**
 * @file home.php
 * @brief Файл містить контроллер Home ля обробки перенаправлення на головну сторінку залежно від типу користувача.
 */
/**
 * @class Home
 * @brief Контролер для обробки перенаправлення на головну сторінку залежно від типу користувача.
 *
 * Клас Home розширює базовий клас Controller і відповідає за перенаправлення користувачів
 * на відповідні головні сторінки залежно від їх типу. Він перевіряє, чи користувач увійшов у систему,
 * отримує тип користувача та відповідно направляє їх.
 */
class Home extends Controller{

    /**
     * @brief Основний метод для контролера Home.
     *
     * Цей метод викликається при доступі до контролера Home. Він виконує наступні дії:
     * - Перевіряє, чи користувач увійшов у систему. Якщо ні, перенаправляє на сторінку входу.
     * - Отримує тип користувача.
     * - Перенаправляє користувача на відповідну головну сторінку залежно від їх типу:
     *   - Користувачі з типом 'teacher' перенаправляються на головну сторінку вчителя.
     *   - Користувачі з типом 'pupil' перенаправляються на головну сторінку учня.
     *   - Усі інші типи користувачів перенаправляються на сторінку помилки 404.
     *
     * @return void
     */
    function index()
    {
        if(!isSignIn()){
            $this->redirect('login');
        }
        $typeOfUser=getUserType();
        if($typeOfUser=='teacher'){
            $this->view("teacherHome");

        }else if($typeOfUser=='pupil'){
            $this->view('home');
        }else{
            $this->view('404_page');
        }
        
    }
 
}