


<?php 
/**
 * @file logout.php
 * @brief Містить клас, який керує процесом вихіду користувачів у веб-застосунку.
 */
/**
 * @class Logout
 * @brief Контролер для обробки виходу з системи.
 *
 * Клас Logout розширює базовий клас Controller і відповідає за обробку виходу користувача
 * з системи. Він видаляє сесію користувача і перенаправляє на сторінку входу.
 */
class Logout extends Controller{

    /**
     * @brief Основний метод для контролера Logout.
     *
     * Цей метод викликається при доступі до контролера Logout. Він виконує наступні дії:
     * - Перевіряє, чи сесія користувача існує.
     * - Якщо сесія користувача існує, вона видаляється.
     * - Перенаправляє користувача на сторінку входу.
     *
     * @return void
     */
    function index(){
        if(isset($_SESSION['user'])){
            unset($_SESSION['user']);
        }
        $this->redirect("login");
    }
}